particle-iot/device-os/hal/src/rtl872x/i2c_hal.cpp
/*
 * Copyright (c) 2020 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include <stdbool.h>
#include <stdint.h>
#include <unistd.h>
#include <string.h>
#include <malloc.h>
#include <cstring>
#include "ringbuffer.h"
#include "i2c_hal.h"
#include "gpio_hal.h"
#include "delay_hal.h"
#include "platforms.h"
#include "concurrent_hal.h"
#include "interrupts_hal.h"
#include "pinmap_impl.h"
#include "logging.h"
#include "system_error.h"
#include "system_tick_hal.h"
#include "timer_hal.h"
#include <memory>
#include "check.h"
#include "service_debug.h"
#include "scope_guard.h"

#ifdef __cplusplus
extern "C" {
#endif
#include "rtl8721d.h"
#ifdef __cplusplus
}
#endif

#define WAIT_TIMED_ROUTINE(timeout_ms, what, func) ({ \
    system_tick_t _micros = HAL_Timer_Get_Micro_Seconds();                      \
    int res = 0;                                                                \
    while ((what)) {                                                            \
        system_tick_t dt = (HAL_Timer_Get_Micro_Seconds() - _micros);           \
        bool nok = (((timeout_ms * 1000) < dt) && (what));                      \
        if (nok) {                                                              \
            res = -1;                                                           \
            break;                                                              \
        }                                                                       \
        if (func()) {                                                           \
            res = 0;                                                            \
            break;                                                              \
        }                                                                       \
    }                                                                           \
    res;                                                                        \
})

#define WAIT_TIMED(timeout_ms, what) ({ \
    system_tick_t _micros = HAL_Timer_Get_Micro_Seconds();                      \
    bool res = true;                                                            \
    while ((what)) {                                                            \
        system_tick_t dt = (HAL_Timer_Get_Micro_Seconds() - _micros);           \
        bool nok = (((timeout_ms * 1000) < dt) && (what));                      \
        if (nok) {                                                              \
            res = false;                                                        \
            break;                                                              \
        }                                                                       \
    }                                                                           \
    res;                                                                        \
})

#define CEIL_DIV(A, B)      (((A) + (B) - 1) / (B))

class I2cClass {
public:
    bool isEnabled() const {
        return state_ == HAL_I2C_STATE_ENABLED;
    }

    int init(const hal_i2c_config_t* conf) {
        if (mutex_ == nullptr) {
            os_mutex_recursive_t mutex = nullptr;
            CHECK_TRUE(os_mutex_recursive_create(&mutex) == 0, SYSTEM_ERROR_NO_MEMORY);

            os_thread_scheduling(false, nullptr);
            if (mutex_ == nullptr) {
                std::swap(mutex, mutex_);
            }
            os_thread_scheduling(true, nullptr);

            if (mutex) {
                // Another thread got here first, destroy ours
                os_mutex_recursive_destroy(mutex);
            }
        }

        lock();
        if (state_ != HAL_I2C_STATE_NOT_INITIALIZED) {
            // Configured, but new buffers are invalid
            if (!isConfigValid(conf)){
                unlock();
                return SYSTEM_ERROR_INVALID_ARGUMENT;
            }
            // Configured, but new buffers are smaller
            if (conf->rx_buffer_size <= rxBuffer_.size() ||
               conf->tx_buffer_size <= txBuffer_.size()) {
               unlock();
               return SYSTEM_ERROR_NOT_ENOUGH_DATA;
            }
            if (heapBuffer_) {
                // The pointers are guaranteed to be non-nullptr when they are inited.
                free(txBuffer_.buffer_);
                free(rxBuffer_.buffer_);
                heapBuffer_ = false;
                // We've acquired lock, it's safe to not change the state_ here.
            }
        } else {
            // Only initialize the struct to default values when it's not initialized before.
            I2C_StructInit(&i2cInitStruct_);
        }
        if (isConfigValid(conf)) {
            rxBuffer_.init((uint8_t*)conf->rx_buffer, conf->rx_buffer_size);
            txBuffer_.init((uint8_t*)conf->tx_buffer, conf->tx_buffer_size);
            heapBuffer_ = ((conf->version >= HAL_I2C_CONFIG_VERSION_2) && (conf->flags & HAL_I2C_CONFIG_FLAG_FREEABLE));
        } else {
            int buffer_size = HAL_PLATFORM_I2C_BUFFER_SIZE(HAL_I2C_INTERFACE1);
            rxBuffer_.init((uint8_t*)malloc(buffer_size), buffer_size);
            txBuffer_.init((uint8_t*)malloc(buffer_size), buffer_size);
            SPARK_ASSERT(txBuffer_.buffer_ && rxBuffer_.buffer_);
            heapBuffer_ = true;
        }
        slaveRxCacheDepth_ = rxBuffer_.size() * 2;
        if (state_ == HAL_I2C_STATE_NOT_INITIALIZED) {
            state_ = HAL_I2C_STATE_DISABLED;
        } else {
            // Do nothing
            // We've just changed the rxBuffer_ and txBuffer_ pointers, leave the state_ as-is.
        }
        unlock();
        return SYSTEM_ERROR_NONE;
    }

    int begin(hal_i2c_mode_t mode, uint8_t address) {
        CHECK_FALSE(state_ == HAL_I2C_STATE_NOT_INITIALIZED, SYSTEM_ERROR_INVALID_STATE);
        if (isEnabled()) {
            end();
        }
        // RCC_PeriphClockCmd(APBPeriph_I2C0, APBPeriph_I2C0_CLOCK, ENABLE);
        Pinmux_Config(hal_pin_to_rtl_pin(sdaPin_), PINMUX_FUNCTION_I2C);
	    Pinmux_Config(hal_pin_to_rtl_pin(sclPin_), PINMUX_FUNCTION_I2C);
        PAD_PullCtrl(hal_pin_to_rtl_pin(sdaPin_), GPIO_PuPd_UP);
	    PAD_PullCtrl(hal_pin_to_rtl_pin(sclPin_), GPIO_PuPd_UP);

        hal_gpio_set_drive_strength(sclPin_, HAL_GPIO_DRIVE_HIGH);
        hal_gpio_set_drive_strength(sdaPin_, HAL_GPIO_DRIVE_HIGH);

        if (mode == I2C_MODE_MASTER) {
            i2cInitStruct_.I2CMaster  = I2C_MASTER_MODE;
            i2cInitStruct_.I2CAckAddr = 0; // This is the peer device's slave address in master mode, not needed herein.
        } else {
            if (hal_interrupt_is_isr()) {
                SPARK_ASSERT(false);
            }
            slaveRxCache_ = std::make_unique<uint8_t[]>(slaveRxCacheDepth_);
            if (!slaveRxCache_) {
                SPARK_ASSERT(false);
            }
            i2cInitStruct_.I2CMaster  = I2C_SLAVE_MODE;
            i2cInitStruct_.I2CAckAddr = address; // This is the local device's slave address in slave mode
        }
        I2C_Init(i2cDev_, &i2cInitStruct_);

        // Enable restart function
        i2cDev_->IC_CON |= BIT_CTRL_IC_CON_IC_RESTART_EN;
        i2cDev_->IC_RX_TL = std::min(rxBuffer_.size(), (size_t)0); // FIFO depth 1

	    I2C_Cmd(i2cDev_, ENABLE);

        if (i2cInitStruct_.I2CMaster == I2C_SLAVE_MODE) {
            slaveStatus_ = I2C_SLAVE_STOPPED;
            slaveRxCacheLen_ = 0;
            InterruptRegister((IRQ_FUN)i2cSlaveIntHandler, I2C0_IRQ_LP, (uint32_t)this, 7);
            I2C_INTConfig(i2cDev_, (BIT_IC_INTR_MASK_M_START_DET | BIT_IC_INTR_MASK_M_RX_FULL | BIT_IC_INTR_MASK_M_STOP_DET |
                                    BIT_IC_INTR_MASK_M_RD_REQ | BIT_IC_INTR_MASK_M_RX_DONE), ENABLE);
            I2C_ClearAllINT(i2cDev_);
            InterruptEn(I2C0_IRQ_LP, 7);
        }

        if (state_ == HAL_I2C_STATE_DISABLED) {
            txBuffer_.reset();
            rxBuffer_.reset();
        }

        state_ = HAL_I2C_STATE_ENABLED;
        HAL_Delay_Milliseconds(10);
        return SYSTEM_ERROR_NONE;
    }

