particle-iot/device-os/hal/src/rtl872x/i2c_hal.cpp
    int end() {
        if (isEnabled()) {
            hal_gpio_config_t conf = {};
            conf.size = sizeof(conf);
            conf.version = HAL_GPIO_VERSION;
            conf.mode = OUTPUT_OPEN_DRAIN_PULLUP;
            conf.set_value = true;
            conf.value = 1;
            conf.drive_strength = HAL_GPIO_DRIVE_DEFAULT;
            hal_gpio_configure(sclPin_, &conf, nullptr);
            hal_gpio_configure(sdaPin_, &conf, nullptr);
            if (i2cInitStruct_.I2CMaster == I2C_SLAVE_MODE) {
                InterruptDis(I2C0_IRQ_LP);
	            InterruptUnRegister(I2C0_IRQ_LP);
                I2C_INTConfig(i2cDev_, (BIT_IC_INTR_MASK_M_START_DET | BIT_IC_INTR_MASK_M_RX_FULL | BIT_IC_INTR_MASK_M_STOP_DET |
                                        BIT_IC_INTR_MASK_M_RD_REQ | BIT_IC_INTR_MASK_M_RX_DONE), DISABLE);
            }
            I2C_Cmd(i2cDev_, DISABLE);
            state_ = HAL_I2C_STATE_DISABLED;
            // RCC_PeriphClockCmd(APBPeriph_I2C0, APBPeriph_I2C0_CLOCK, DISABLE);
        }
        return SYSTEM_ERROR_NONE;
    }

    int suspend() {
        CHECK_TRUE(state_ = HAL_I2C_STATE_ENABLED, SYSTEM_ERROR_INVALID_STATE);
        CHECK(end());
        state_ = HAL_I2C_STATE_SUSPENDED;
        return SYSTEM_ERROR_NONE;
    }

    int restore() {
        CHECK_TRUE(state_ = HAL_I2C_STATE_SUSPENDED, SYSTEM_ERROR_INVALID_STATE);
        return begin((i2cInitStruct_.I2CMaster == I2C_MASTER_MODE) ? I2C_MODE_MASTER : I2C_MODE_SLAVE, i2cInitStruct_.I2CAckAddr);
    }

    int reset() {
        end();

        // Just in case make sure that the pins are correctly configured (they should anyway be at this point)
        hal_gpio_config_t conf = {};
        conf.size = sizeof(conf);
        conf.version = HAL_GPIO_VERSION;
        conf.mode = OUTPUT_OPEN_DRAIN_PULLUP;
        conf.set_value = true;
        conf.value = 1;
        conf.drive_strength = HAL_GPIO_DRIVE_DEFAULT;
        hal_gpio_configure(sclPin_, &conf, nullptr);
        hal_gpio_configure(sdaPin_, &conf, nullptr);

        // Check if slave is stretching the SCL
        if (!WAIT_TIMED(HAL_I2C_DEFAULT_TIMEOUT_MS, hal_gpio_read(sclPin_) == 0)) {
            return SYSTEM_ERROR_I2C_BUS_BUSY;
        }

        // Generate up to 9 pulses on SCL to tell slave to release the bus
        for (int i = 0; i < 9; i++) {
            if (hal_gpio_read(sdaPin_) == 0) {
                hal_gpio_write(sclPin_, 0);
                HAL_Delay_Microseconds(50);
                hal_gpio_write(sclPin_, 1);
                HAL_Delay_Microseconds(50);
                hal_gpio_write(sclPin_, 0);
                HAL_Delay_Microseconds(50);
            } else {
                break;
            }
        }

        // Generate STOP condition: pull SDA low, switch to high
        hal_gpio_write(sdaPin_, 0);
        HAL_Delay_Microseconds(50);
        hal_gpio_write(sclPin_, 1);
        HAL_Delay_Microseconds(50);
        hal_gpio_write(sdaPin_, 1);
        HAL_Delay_Microseconds(50);

        hal_pin_set_function(sdaPin_, PF_I2C);
        hal_pin_set_function(sclPin_, PF_I2C);

        hal_i2c_mode_t mode = (i2cInitStruct_.I2CMaster  == I2C_MASTER_MODE) ? I2C_MODE_MASTER : I2C_MODE_SLAVE;
        begin(mode, i2cInitStruct_.I2CAckAddr);
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INTERNAL);
        return SYSTEM_ERROR_NONE;
    }

    int setSpeed(uint32_t speed) {
        bool enabled = isEnabled();
        if (enabled) {
            I2C_Cmd(i2cDev_, DISABLE);
            state_ = HAL_I2C_STATE_DISABLED;
        }
        i2cInitStruct_.I2CSpdMod = ((speed == CLOCK_SPEED_400KHZ) ? I2C_FS_MODE : I2C_SS_MODE );
        i2cInitStruct_.I2CClk    = ((speed == CLOCK_SPEED_100KHZ) ? 100 :
                                    (speed < CLOCK_SPEED_100KHZ && speed >= CLOCK_SPEED_10KHZ) ? CEIL_DIV(speed, 1000) : 400);
        if (enabled) {
            I2C_Init(i2cDev_, &i2cInitStruct_);
            I2C_Cmd(i2cDev_, ENABLE);
            state_ = HAL_I2C_STATE_ENABLED;
        }
        return SYSTEM_ERROR_NONE;
    }

    int setAddress(uint8_t address) {
        if (i2cInitStruct_.I2CAckAddr != address) {
            bool enabled = isEnabled();
            if (enabled) {
                I2C_Cmd(i2cDev_, DISABLE);
                state_ = HAL_I2C_STATE_DISABLED;
            }
            i2cInitStruct_.I2CAckAddr = address;
            if (enabled) {
                I2C_Init(i2cDev_, &i2cInitStruct_);
                I2C_Cmd(i2cDev_, ENABLE);
                state_ = HAL_I2C_STATE_ENABLED;
            }
        }
        return SYSTEM_ERROR_NONE;
    }

    ssize_t requestFrom(const hal_i2c_transmission_config_t* config) {
        if (i2cInitStruct_.I2CMaster != I2C_MASTER_MODE) {
            return 0;
        }
        rxBuffer_.reset();
        uint32_t quantity = std::min((size_t)config->quantity, rxBuffer_.size());

        // Dirty-hack: It may not generate the start signal when communicating with certain type of slave device.
        if (reEnableIfNeeded() != SYSTEM_ERROR_NONE) {
            return 0;
        }

        setAddress(config->address);

        bool waitStop = false;
        for (uint32_t i = 0; i < quantity; i++) {
            if(i >= quantity - 1) {
                if (config->flags & HAL_I2C_TRANSMISSION_FLAG_STOP) {
                    // Generate stop signal
                    i2cDev_->IC_DATA_CMD = 0x0003 << 8;
                    waitStop = true;
                } else {
                    // Generate restart signal
                    i2cDev_->IC_DATA_CMD = 0x0005 << 8;
                }
            } else {
                i2cDev_->IC_DATA_CMD = 0x0001 << 8;
            }
            // Wait for I2C_FLAG_RFNE flag
            if (WAIT_TIMED_ROUTINE(config->timeout_ms, I2C_CheckFlagState(i2cDev_, BIT_IC_STATUS_RFNE) == 0, checkAbrt) < 0) {
                reset();
                LOG_DEBUG(TRACE, "Wait BIT_IC_STATUS_RFNE timeout");
                goto ret;
            }
            if(checkAbrt()) {
                LOG_DEBUG(TRACE, "Abort: %08X", i2cDev_->IC_TX_ABRT_SOURCE);
                I2C_ClearAllINT(i2cDev_);
                goto ret;
            }
            if (waitStop && !WAIT_TIMED(config->timeout_ms, !stopDetected())) {
                reset();
                return SYSTEM_ERROR_I2C_STOP_TIMEOUT;
            }
            rxBuffer_.put((uint8_t)i2cDev_->IC_DATA_CMD);
        }
    ret:
        return rxBuffer_.data();
    }

    ssize_t available() {
        return rxBuffer_.data();
    }

    uint8_t read() {
        uint8_t data = 0xFF;
        if (rxBuffer_.get(&data) != 1) {
            return 0xFF;
        }
        return data;
    }

    uint8_t peek() {
        uint8_t data = 0xFF;
        if (rxBuffer_.peek(&data) != 1) {
            return 0xFF;
        }
        return data;
    }

    void setConfigOrDefault(const hal_i2c_transmission_config_t* config, uint8_t address) {
        memset(&transConfig_, 0, sizeof(transConfig_));
        if (config) {
            memcpy(&transConfig_, config, std::min((size_t)config->size, sizeof(transConfig_)));
        } else {
            transConfig_ = {
                .size = sizeof(hal_i2c_transmission_config_t),
                .version = 0,
                .address = address,
                .reserved = {0},
                .quantity = 0,
                .timeout_ms = HAL_I2C_DEFAULT_TIMEOUT_MS,
                .flags = HAL_I2C_TRANSMISSION_FLAG_STOP,
                .buffer = nullptr
            };
        }
    }

    ssize_t write(uint8_t data) {
        txBuffer_.put(data);
        return 1;
    }

    int beginTransmission(uint8_t address, const hal_i2c_transmission_config_t* config) {
        setConfigOrDefault(config, address);
        txBuffer_.reset();
        return SYSTEM_ERROR_NONE;
    }

    int endTransmission(uint8_t stop, const hal_i2c_transmission_config_t* config = nullptr) {
        auto transConfig = transConfig_;
        if (config) {
            memset(&transConfig, 0, sizeof(transConfig));
            memcpy(&transConfig, config, std::min((size_t)config->size, sizeof(transConfig)));
        }
        SCOPE_GUARD({
            txBuffer_.reset();
        });
        if (i2cInitStruct_.I2CMaster != I2C_MASTER_MODE) {
            return SYSTEM_ERROR_INVALID_STATE;
        }

        // Dirty-hack: It may not generate the start signal when communicating with certain type of slave device.
        CHECK(reEnableIfNeeded());

        setAddress(transConfig.address);

        uint32_t quantity = txBuffer_.data();
        if (quantity == 0) {
            // Clear flags
            uint32_t temp = i2cDev_->IC_CLR_TX_ABRT;
            temp = i2cDev_->IC_CLR_STOP_DET;
            (void)temp;
            if ((i2cDev_->IC_TX_ABRT_SOURCE & BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK)
                 || (i2cDev_->IC_RAW_INTR_STAT & BIT_IC_RAW_INTR_STAT_STOP_DET)) {
                return SYSTEM_ERROR_I2C_ABORT;
            }
            // Send the slave address only
            i2cDev_->IC_DATA_CMD = (transConfig.address << 1) | BIT_CTRL_IC_DATA_CMD_NULLDATA | BIT_CTRL_IC_DATA_CMD_STOP;
            // If slave is not detected, the STOP_DET bit won't be set, and the TX_ABRT is set instead.
            if (!WAIT_TIMED(transConfig.timeout_ms, ((i2cDev_->IC_TX_ABRT_SOURCE & BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK) == 0)
                                                  && ((i2cDev_->IC_RAW_INTR_STAT & BIT_IC_RAW_INTR_STAT_STOP_DET) == 0))) {
                return SYSTEM_ERROR_I2C_TX_ADDR_TIMEOUT;
            }
            if (i2cDev_->IC_TX_ABRT_SOURCE & BIT_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK) {
                return SYSTEM_ERROR_I2C_ABORT;
            }
            return SYSTEM_ERROR_NONE;
        }

        bool waitStop = false;
        for (uint32_t i = 0; i < quantity; i++) {
            if (!WAIT_TIMED(transConfig.timeout_ms, I2C_CheckFlagState(i2cDev_, BIT_IC_STATUS_TFNF) == 0)) {
                reset();
                return SYSTEM_ERROR_I2C_FILL_DATA_TIMEOUT;
            }
            uint8_t data = 0xFF;
            if (txBuffer_.get(&data) != 1) {
                return SYSTEM_ERROR_NOT_ENOUGH_DATA;
            }
            if(i >= quantity - 1) {
                if (stop) {
                    // Generate stop signal
                    i2cDev_->IC_DATA_CMD = data | BIT_CTRL_IC_DATA_CMD_STOP;
                    waitStop = true;
                } else {
                    // Generate restart signal
                    i2cDev_->IC_DATA_CMD = data | BIT_CTRL_IC_DATA_CMD_RESTART;
                }
            } else {
                // The address will be sent before sending the first data byte
                i2cDev_->IC_DATA_CMD = data;
            }
            if (WAIT_TIMED_ROUTINE(transConfig.timeout_ms, I2C_CheckFlagState(i2cDev_, BIT_IC_STATUS_TFE) == 0, checkAbrt) < 0) {
                reset();
                return SYSTEM_ERROR_I2C_TX_DATA_TIMEOUT;
            }
            if(checkAbrt()) {
                LOG_DEBUG(TRACE, "Abort: %08X", i2cDev_->IC_TX_ABRT_SOURCE);
                I2C_ClearAllINT(i2cDev_);
                return SYSTEM_ERROR_CANCELLED;
            }
        }
        if (waitStop && !WAIT_TIMED(transConfig.timeout_ms, !stopDetected())) {
            reset();
            return SYSTEM_ERROR_I2C_STOP_TIMEOUT;
        }
        return SYSTEM_ERROR_NONE;
    }

