particle-iot/device-os/hal/src/rtl872x/i2c_hal.cpp
    int transaction(const hal_i2c_transmission_config_t* txConfig, const hal_i2c_transmission_config_t* rxConfig) {
        // A quick hack for now with a temp copy
        particle::services::RingBuffer<uint8_t> txBuffer(txConfig ? txConfig->buffer : nullptr, txConfig ? txConfig->quantity : 0);
        particle::services::RingBuffer<uint8_t> rxBuffer(rxConfig ? rxConfig->buffer : nullptr, rxConfig ? rxConfig->quantity : 0);
        if (txConfig) {
            if (txConfig->quantity) {
                CHECK_TRUE(txConfig->buffer, SYSTEM_ERROR_INVALID_ARGUMENT);
            }
            txBuffer.acquire(txConfig->quantity);
            txBuffer.acquireCommit(txConfig->quantity);
            std::swap(txBuffer, txBuffer_);
        }
        if (rxConfig) {
            if (rxConfig->quantity) {
                CHECK_TRUE(rxConfig->buffer, SYSTEM_ERROR_INVALID_ARGUMENT);
            }
            std::swap(rxBuffer, rxBuffer_);
        }
        SCOPE_GUARD({
            if (txConfig) {
                std::swap(txBuffer, txBuffer_);
            }
            if (rxConfig) {
                std::swap(rxBuffer, rxBuffer_);
            }
        });
        if (txConfig) {
            CHECK(endTransmission(!!(txConfig->flags & HAL_I2C_TRANSMISSION_FLAG_STOP), txConfig));
        }
        if (rxConfig) {
            return requestFrom(rxConfig);
        }
        return 0;
    }

    void flush() {
        txBuffer_.reset();
        rxBuffer_.reset();
    }

    void setOnRequestedCallback(void (*function)(void)) {
        onRequested_ = function;
    }

    void setOnReceivedCallback(void (*function)(int)) {
        onReceived_ = function;
    }

    int lock() {
        if (mutex_ && !hal_interrupt_is_isr()) {
            return os_mutex_recursive_lock(mutex_);
        }
        return SYSTEM_ERROR_INVALID_STATE;
    }

    int unlock() {
        if (mutex_ && !hal_interrupt_is_isr()) {
            return os_mutex_recursive_unlock(mutex_);
        }
        return SYSTEM_ERROR_INVALID_STATE;
    }

    static I2cClass* getInstance(hal_i2c_interface_t i2c) {
        static I2cClass i2cs[] = {
            { I2C0_DEV, SDA, SCL }
        };
        CHECK_TRUE(i2c < sizeof(i2cs) / sizeof(i2cs[0]), nullptr);
        return &i2cs[i2c];
    }

private:
    enum I2cSlaveStatus {
        I2C_SLAVE_STOPPED,
        I2C_SLAVE_STARTED,
        I2C_SLAVE_RESTARTED,
        I2C_SLAVE_TX,
        I2C_SLAVE_RX,
    };

    I2cClass(I2C_TypeDef* i2cDev, hal_pin_t sda, hal_pin_t scl)
            : i2cDev_(i2cDev),
              sdaPin_(sda),
              sclPin_(scl),
              state_(HAL_I2C_STATE_NOT_INITIALIZED),
              slaveStatus_(I2C_SLAVE_STOPPED),
              heapBuffer_(false),
              i2cInitStruct_(),
              onRequested_(nullptr),
              onReceived_(nullptr),
              mutex_(nullptr),
              slaveRxCache_(nullptr),
              slaveRxCacheLen_(0),
              slaveRxCacheDepth_(HAL_PLATFORM_I2C_BUFFER_SIZE(HAL_I2C_INTERFACE1) * 2) {
    }
    ~I2cClass() = default;

    bool masterRestarted() {
        return (i2cDev_->IC_RAW_INTR_STAT & BIT_IC_INTR_STAT_R_START_DET) &&
                !(i2cDev_->IC_RAW_INTR_STAT & BIT_IC_INTR_STAT_R_STOP_DET) &&
                (i2cDev_->IC_RAW_INTR_STAT & BIT_IC_INTR_STAT_R_ACTIVITY);
    }

    int reEnableIfNeeded() {
        if (!masterRestarted()) {
            i2cDev_->IC_ENABLE |= 0x00000002; // Abort the current transfer without flush Tx/Rx FIFO
            I2C_Cmd(i2cDev_, DISABLE);
            if (!WAIT_TIMED(transConfig_.timeout_ms, (i2cDev_->IC_ENABLE_STATUS & 0x00000001) == 1)) {
                reset();
                LOG_DEBUG(TRACE, "SYSTEM_ERROR_I2C_BUS_BUSY");
                return SYSTEM_ERROR_I2C_BUS_BUSY;
            }
            I2C_Cmd(i2cDev_, ENABLE);
            if (!WAIT_TIMED(transConfig_.timeout_ms, (i2cDev_->IC_ENABLE_STATUS & 0x00000001) == 0)) {
                return SYSTEM_ERROR_INTERNAL;
            }
        }
        clearIntStatus();
        return SYSTEM_ERROR_NONE;
    }

    bool stopDetected() {
        return (i2cDev_->IC_RAW_INTR_STAT & BIT_IC_INTR_STAT_R_STOP_DET) == BIT_IC_INTR_STAT_R_STOP_DET;
    }

    void clearIntStatus() {
        uint32_t temp = i2cDev_->IC_CLR_INTR;
        (void)temp;
    }

    bool isConfigValid(const hal_i2c_config_t* config) {
        if ((config == nullptr) || (config->rx_buffer == nullptr || config->rx_buffer_size == 0 ||
                config->tx_buffer == nullptr || config->tx_buffer_size == 0)) {
            return false;
        }
        return true;
    }

    bool checkAbrt() {
        if(I2C_GetRawINT(i2cDev_) & BIT_IC_RAW_INTR_STAT_TX_ABRT) {
            return true;
        }
        return false;
    }

    void slaveStopDetected() {
        if (slaveRxCacheLen_ > 0) {
            slaveReportRx();
        }
        slaveStatus_ = I2C_SLAVE_STOPPED;
        txBuffer_.reset();
    }

    void slaveStartDetected() {
        if (slaveStatus_ == I2C_SLAVE_STOPPED) {
            slaveStatus_ = I2C_SLAVE_STARTED;
        } else {
            // Repeated start: report the write received so far
            if (slaveRxCacheLen_ > 0) {
                slaveReportRx();
            }
            slaveStatus_ = I2C_SLAVE_RESTARTED;
        }
    }

    void slaveDrainRxFifo() {
        while (I2C_CheckFlagState(i2cDev_, (BIT_IC_STATUS_RFNE | BIT_IC_STATUS_RFF))) {
            uint8_t data = (uint8_t)I2C_ReceiveData(i2cDev_);
            if (slaveRxCacheLen_ < slaveRxCacheDepth_) {
                slaveRxCache_[slaveRxCacheLen_++] = data;
            }
        }
    }

    void slaveReportRx() {
        while (slaveRxCacheLen_ > 0) {
            size_t len = std::min(rxBuffer_.size(), (size_t)slaveRxCacheLen_);
            rxBuffer_.put(slaveRxCache_.get(), len);
            if (onReceived_) {
                onReceived_(rxBuffer_.data());
            }
            rxBuffer_.reset();
            slaveRxCacheLen_ -= len;
            std::memmove(slaveRxCache_.get(), &slaveRxCache_[len], slaveRxCacheLen_);
        }
    }

    void slaveWrite() {
        if (txBuffer_.data() <= 0) {
            if (onRequested_) {
                onRequested_();
            }
        }
        uint8_t data = 0xFF;
        if (txBuffer_.get(&data) == 1) {
            I2C_SlaveSend(i2cDev_, data);
        } else {
            I2C_SlaveSend(i2cDev_, 0xFF);
        }
    }

    // WARNNING: critical timing section.
    // The bus may have moved on while this interrupt was delayed: one status read can
    // then report, for example, the stop of a transaction and the start of the next,
    // so every set interrupt bit in the snapshot is serviced, whatever state the
    // state machine is in.
    static void i2cSlaveIntHandler(void* context) {
        auto instance = (I2cClass*)context;
        uint32_t intStatus = I2C_GetINT(instance->i2cDev_);

