particle-iot/device-os/hal/src/rtl872x/i2c_hal.cpp
        if (intStatus & BIT_IC_INTR_STAT_R_STOP_DET) {
            I2C_ClearINT(instance->i2cDev_, BIT_IC_INTR_STAT_R_STOP_DET);
        }
        if (intStatus & BIT_IC_INTR_STAT_R_START_DET) {
            I2C_ClearINT(instance->i2cDev_, BIT_IC_INTR_STAT_R_START_DET);
        }
        if (intStatus & BIT_IC_INTR_STAT_R_RX_DONE) {
            I2C_ClearINT(instance->i2cDev_, BIT_IC_INTR_STAT_R_RX_DONE);
        }
        if (intStatus & BIT_IC_INTR_STAT_R_RD_REQ) {
            I2C_ClearINT(instance->i2cDev_, BIT_IC_INTR_STAT_R_RD_REQ);
        }
        // Drain the FIFO before the start/stop handling below, so that the bytes
        // received before a start or a stop belong to the transfer it ends
        if (intStatus & BIT_IC_INTR_STAT_R_RX_FULL) {
            instance->slaveDrainRxFifo();
        }
        if (intStatus & BIT_IC_INTR_STAT_R_STOP_DET) {
            instance->slaveStopDetected();
        }
        if (intStatus & BIT_IC_INTR_STAT_R_START_DET) {
            instance->slaveStartDetected();
        }
        if (intStatus & BIT_IC_INTR_STAT_R_RD_REQ) {
            instance->slaveStatus_ = I2C_SLAVE_TX;
            instance->slaveWrite();
        }
        if (intStatus & BIT_IC_INTR_STAT_R_RX_DONE) {
            instance->txBuffer_.reset();
        }
    }

    I2C_TypeDef* i2cDev_;
    hal_pin_t sdaPin_;
    hal_pin_t sclPin_;

    volatile hal_i2c_state_t state_;
    volatile uint8_t slaveStatus_;

    particle::services::RingBuffer<uint8_t> txBuffer_;
    particle::services::RingBuffer<uint8_t> rxBuffer_;
    bool heapBuffer_;

    I2C_InitTypeDef i2cInitStruct_;
    hal_i2c_transmission_config_t transConfig_;

    void (*onRequested_)(void);
    void (*onReceived_)(int);

    os_mutex_recursive_t mutex_;

    std::unique_ptr<uint8_t[]> slaveRxCache_;
    volatile uint16_t slaveRxCacheLen_;
    uint16_t slaveRxCacheDepth_;
};

class I2cLock {
public:
    I2cLock() = delete;

    I2cLock(I2cClass* i2c)
            : i2c_(i2c) {
        i2c_->lock();
    }

    ~I2cLock() {
        i2c_->unlock();
    }

private:
    I2cClass* i2c_;
};


int hal_i2c_init(hal_i2c_interface_t i2c, const hal_i2c_config_t* config) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    return instance->init(config);
}

void hal_i2c_set_speed(hal_i2c_interface_t i2c, uint32_t speed, void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    instance->setSpeed(speed);
}

void hal_i2c_stretch_clock(hal_i2c_interface_t i2c, bool stretch, void* reserved) {
    // always enabled
}

void hal_i2c_begin(hal_i2c_interface_t i2c, hal_i2c_mode_t mode, uint8_t address, void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    instance->begin(mode, address);
}

void hal_i2c_end(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    if (hal_i2c_is_enabled(i2c, nullptr)) {
        instance->end();
    }
}

uint32_t hal_i2c_request(hal_i2c_interface_t i2c, uint8_t address, uint8_t quantity, uint8_t stop, void* reserved) {
    hal_i2c_transmission_config_t conf = {
        .size = sizeof(hal_i2c_transmission_config_t),
        .version = 0,
        .address = address,
        .reserved = {0},
        .quantity = quantity,
        .timeout_ms = HAL_I2C_DEFAULT_TIMEOUT_MS,
        .flags = (uint32_t)(stop ? HAL_I2C_TRANSMISSION_FLAG_STOP : 0),
        .buffer = nullptr
    };
    return hal_i2c_request_ex(i2c, &conf, nullptr);
}

int32_t hal_i2c_request_ex(hal_i2c_interface_t i2c, const hal_i2c_transmission_config_t* config, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), 0);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr) || !config) {
        return 0;
    }
    return instance->requestFrom(config);
}

void hal_i2c_begin_transmission(hal_i2c_interface_t i2c, uint8_t address, const hal_i2c_transmission_config_t* config) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return;
    }
    instance->beginTransmission(address, config);
}

uint8_t hal_i2c_end_transmission(hal_i2c_interface_t i2c, uint8_t stop, void* reserved) {
    return hal_i2c_compat_error_from(hal_i2c_end_transmission_ext(i2c, stop, reserved));
}

int hal_i2c_end_transmission_ext(hal_i2c_interface_t i2c, uint8_t stop, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_INVALID_ARGUMENT);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return instance->endTransmission(stop);
}

uint32_t hal_i2c_write(hal_i2c_interface_t i2c, uint8_t data, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), 0);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return 0;
    }
    return instance->write(data);
}

int32_t hal_i2c_available(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return instance->available();
}

int32_t hal_i2c_read(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return instance->read();
}

int32_t hal_i2c_peek(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return instance->peek();
}

void hal_i2c_flush(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return;
    }
    instance->flush();
}

bool hal_i2c_is_enabled(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), false);
    I2cLock lk(instance);
    return instance->isEnabled();
}

void hal_i2c_set_callback_on_received(hal_i2c_interface_t i2c, void (*function)(int),void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    instance->setOnReceivedCallback(function);
}

void hal_i2c_set_callback_on_requested(hal_i2c_interface_t i2c, void (*function)(void),void* reserved) {
    auto instance = I2cClass::getInstance(i2c);
    if (!instance) {
        return;
    }
    I2cLock lk(instance);
    instance->setOnRequestedCallback(function);
}

void hal_i2c_enable_dma_mode(hal_i2c_interface_t i2c, bool enable, void* reserved) {
    // use DMA to send data by default
}

int hal_i2c_reset(hal_i2c_interface_t i2c, uint32_t reserved, void* reserved1) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    return instance->reset();
}

int32_t hal_i2c_lock(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    return instance->lock();
}

int32_t hal_i2c_unlock(hal_i2c_interface_t i2c, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    return instance->unlock();
}

int hal_i2c_sleep(hal_i2c_interface_t i2c, bool sleep, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    if (sleep) {
        return instance->suspend();
    } else {
        return instance->restore();
    }
    return SYSTEM_ERROR_NONE;
}

int hal_i2c_transaction(hal_i2c_interface_t i2c, const hal_i2c_transmission_config_t* tx_config, const hal_i2c_transmission_config_t* rx_config, void* reserved) {
    auto instance = CHECK_TRUE_RETURN(I2cClass::getInstance(i2c), SYSTEM_ERROR_NOT_FOUND);
    I2cLock lk(instance);
    if (!hal_i2c_is_enabled(i2c, nullptr)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return instance->transaction(tx_config, rx_config);
}
